//
// Created by 11549 on 2021/11/30.
//

#ifndef ELDER_COMM_SAY_H
#define ELDER_COMM_SAY_H

#include <stdio.h>
#include <time.h>

void mysleep(double t)
{
    clock_t st = clock();
    while ((double) (clock() - st) / CLOCKS_PER_SEC < t);
}

void play_ani()
{
    printf("系统加载中");
    fflush(stdout);
    mysleep(0.6);
    printf(".");
    fflush(stdout);
    mysleep(0.6);
    printf(".");
    fflush(stdout);
    mysleep(0.6);
    printf(".\n");
    fflush(stdout);
    mysleep(0.6);
    printf("本系统由最优秀的工程师");
    fflush(stdout);
    mysleep(0.6);
    printf("经过多年研发，倾力打造，");
    fflush(stdout);
    mysleep(0.6);
    printf("只求给您最完美的体验。。\n");
    mysleep(0.6);
    fflush(stdout);
    printf("3..");
    fflush(stdout);
    mysleep(0.6);
    printf("2..");
    fflush(stdout);
    mysleep(0.6);
    printf("1..\n");
    fflush(stdout);
    mysleep(0.6);
    printf("加载完成\n");
}


void say_sentence()
{
    const static char a[][1005] = {
            "不似秋光，只与离人照断肠\n\t——苏轼《减字木兰花·春月》",
            "不系雕鞍门前柳，玉容寂寞见花羞，冷风儿吹雨黄昏后\n\t——乔吉《春闺怨·不系雕鞍门前柳》",
            "草木也知愁，韶华竟白头\n\t——曹雪芹《唐多令·柳絮》",
            "长记别伊时，和泪出门相送\n\t——李存勖《如梦令·曾宴桃源深洞》",
            "怅卧新春白袷衣，白门寥落意多违\n\t——李商隐《春雨》",
            "潮平两岸阔，风正一帆悬\n\t——王湾《次北固山下》",
            "沉舟侧畔千帆过，病树前头万木春\n\t——刘禹锡《酬乐天扬州初逢席上见赠》",
            "愁里高歌梁父吟，犹如金玉戛商音\n\t——郑思肖《二砺》",
            "垂下帘栊。双燕归来细雨中\n\t——欧阳修《采桑子·群芳过后西湖好》",
            "春梦醒来么？对春帆细雨，独自吟哦\n\t——谭嗣同《望海潮·自题小影》",
            "春去也，飞红万点愁如海\n\t——秦观《千秋岁·水边沙外》",
            "丹阳城南秋海阴，丹阳城北楚云深\n\t——王昌龄《芙蓉楼送辛渐二首》",
            "但见泪痕湿，不知心恨谁\n\t——李白《怨情》",
            "当轩对尊酒，四面芙蓉开\n\t——王维《临湖亭》",
            "得欢当作乐，斗酒聚比邻\n\t——陶渊明《杂诗·人生无根蒂》 ",
            "吊影分为千里雁，辞根散作九秋蓬\n\t——白居易《望月有感》",
            "东风力，快将云雁高送\n\t——吴文英《宴清都·送马林屋赴南宫分韵得动字》",
            "东篱把酒黄昏后，有暗香盈袖\n\t——李清照《醉花阴·薄雾浓云愁永昼》",
            "芳洲拾翠暮忘归，秀野踏青来不定\n\t——张先《木兰花·乙卯吴兴寒食》",
            "吠犬杂鸣鸡，灯火荧荧归路迷\n\t——纳兰性德《南乡子·秋暮村居》 ",
            "公子南桥应尽兴，将军西第几留宾\n\t——杜审言《春日京中有怀》",
            "归装渐理君知否？笑指庐山古涧藤\n\t——陆游《自咏示客》",
            "桂花浮玉，正月满天街，夜凉如洗\n\t——文征明《念奴娇·中秋对月》",
            "还君明珠双泪垂，恨不相逢未嫁时\n\t——张籍《节妇吟·寄东平李司空师道》",
            "寒食后，酒醒却咨嗟\n\t——苏轼《望江南·超然台作》",
            "汉月垂乡泪，胡沙费马蹄\n\t——岑参《碛西头送李判官入京》",
            "黑云翻墨未遮山，白雨跳珠乱入船\n\t——苏轼《六月二十七日望湖楼醉书》",
            "红叶满寒溪，一路空山万木齐\n\t——纳兰性德《南乡子·秋暮村居》",
            "胡沙没马足，朔风裂人肤\n\t——韦元甫《木兰歌》",
            "槐阴别院宜清昼，入座春风秀。美人图子阿谁留\n\t——元好问《虞美人·槐阴别院宜清昼》",
            "回首昭阳离落日，伤心铜雀迎秋月\n\t——文天祥《满江红·代王夫人作》 ",
            "惠远祠前晋溪水，翠叶银花清见底\n\t——元好问《过晋阳故城书事》",
            "寄语洛城风日道，明年春色倍还人\n\t——杜审言《春日京中有怀》",
            "剑花寒，夜坐归心壮，又是他乡\n\t——张可久《满庭芳·客中九日》",
            "江寒水不流，鱼嚼梅花影\n\t——释敬安《题寒江钓雪图》",
            "江上阴云锁梦魂，江边深夜舞刘琨\n\t——谭用之《秋宿湘江遇雨》",
            "江上月明胡雁过，淮南木落楚山多\n\t——刘长卿《江州重别薛六柳八二员外》",
            "解落三秋叶，能开二月花\n\t——李峤《风》",
            "金谷园中柳，春来似舞腰\n\t——李益《上洛桥》",
            "京国多年情尽改，忽听春雨忆江南\n\t——虞集《听雨》",
            "九曲黄河万里沙，浪淘风簸自天涯\n\t——刘禹锡《浪淘沙·九曲黄河万里沙》",
            "看风流慷慨，谈笑过残年\n\t——辛弃疾《八声甘州·故将军饮罢夜归来》",
            "看雪飞、苹底芦梢，未如鬓白\n\t——吴文英《瑞鹤仙·秋感》",
            "况屈指中秋，十分好月，不照人圆\n\t——辛弃疾《木兰花慢·滁州送范倅》",
            "郎到断桥须有路，侬住处，柳如金\n\t——张惠言《江城子·填张春溪西湖竹枝词》",
            "良辰当五日，偕老祝千年\n\t——权德舆《端午日礼部宿斋有衣服彩结之贶以诗还答》",
            "两句三年得，一吟双泪流\n\t——贾岛《题诗后》",
            "龙吟虎啸一时发，万籁百泉相与秋\n\t——李颀《听安万善吹觱篥歌》",
            "鹿车何日驾，归去颍东田\n\t——欧阳修《秋怀》",
            "罗襟湿未干，又是凄凉雪\n\t——张淑芳《满路花·冬》",
            "绿兮丝兮，女所治兮。我思古人，俾无訧兮\n\t——佚名《绿衣》",
            "莫惊鸥鹭，四桥尽是，老子经行处\n\t——苏轼《青玉案·送伯固归吴中》",
            "莫向西湖歌此曲，水光山色不胜悲\n\t——赵孟頫《岳鄂王墓》",
            "那里是清江江上村，香闺里冷落谁瞅问？好一个憔悴的凭栏人\n\t——关汉卿《大德歌·冬》",
            "七八个星天外，两三点雨山前\n\t——辛弃疾《西江月·夜行黄沙道中》",
            "妾本秦罗敷，玉颜艳名都\n\t——李白《陌上桑》 ",
            "清明过了，不堪回首，云锁朱楼\n\t——朱淑真《眼儿媚·风日迟迟弄轻柔》",
            "秋到边城角声哀，烽火照高台\n\t——陆游《秋波媚·七月十六日晚登高兴亭望长安南山》",
            "曲终人醉。多似浔阳江上泪\n\t——朱敦儒《减字木兰花·刘郎已老》",
            "冉冉秋光留不住，满阶红叶暮\n\t——李煜《谢新恩·冉冉秋光留不住》",
            "任宝奁尘满，日上帘钩\n\t——李清照《凤凰台上忆吹箫·香冷金猊》",
            "日归功未建，时往岁载阴\n\t——陆机《猛虎行》",
            "日晚江南望江北，寒鸦飞尽水悠悠\n\t——严维《丹阳送韦参军》",
            "日下壁而沉彩，月上轩而飞光\n\t——江淹《别赋》",
            "桑之未落，其叶沃若\n\t——佚名《氓》",
            "山中夜来月，到晓不曾看\n\t——元好问《倪庄中秋》",
            "上窗风动竹，月微明\n\t——吕渭老《小重山·七夕病中》",
            "少年不识愁滋味，爱上层楼。爱上层楼。为赋新词强说愁\n\t——辛弃疾《丑奴儿·书博山道中壁》",
            "笙歌散尽游人去，始觉春空\n\t——欧阳修《采桑子·群芳过后西湖好》",
            "盛年不重来，一日难再晨\n\t——陶渊明《杂诗·人生无根蒂》",
            "世间行乐亦如此，古来万事东流水\n\t——李白《梦游天姥吟留别 / 别东鲁诸公》",
            "梳洗罢，独倚望江楼\n\t——温庭筠《望江南·梳洗罢》 ",
            "疏星淡月秋千院，愁云恨雨芙蓉面\n\t——张可久《塞鸿秋·春情》",
            "戍鼓断人行，边秋一雁声\n\t——杜甫《月夜忆舍弟》",
            "水晶帘不下，云母屏开，冷浸佳人淡脂粉\n\t——晁补之《洞仙歌·泗州中秋作》",
            "思君如流水，何有穷已时\n\t——徐干《室思》",
            "松叶堪为酒，春来酿几多\n\t——张九龄《答陆澧》",
            "窣地春袍，嫩色宜相照\n\t——梅尧臣《苏幕遮·草》",
            "台高不尽看枫叶，院净何须坐菊花\n\t——沈辂《九日登高台寺》",
            "梯横画阁黄昏后，又还是、斜月帘栊\n\t——张先《一丛花令·伤高怀远几时穷》",
            "天与短因缘，聚散常容易\n\t——晏几道《生查子·狂花顷刻香》",
            "田田初出水，菡萏念娇蕊\n\t——龚翔麟《菩萨蛮·题画》",
            "铜壶漏报天将晓，惆怅佳期又一年\n\t——罗隐《七夕》 ",
            "铜铸金镛振纪纲，声传海外播戎羌\n\t——曹雪芹《交趾怀古》",
            "晚风收暑，小池塘荷净\n\t——刘光祖《洞仙歌·荷花》 ",
            "万里乘云去复来，只身东海挟春雷\n\t——秋瑾《黄海舟中日人索句并见日俄战争地图》",
            "万里寒光生积雪，三边曙色动危旌\n\t——祖咏《望蓟门》",
            "万里想龙沙，泣孤臣吴越\n\t——张元干《石州慢·己酉秋吴兴舟中作》",
            "万条千缕绿相迎。舞烟眠雨过清明\n\t——晏几道《浣溪沙·二月和风到碧城》",
            "望处雨收云断，凭阑悄悄，目送秋光\n\t——柳永《玉蝴蝶·望处雨收云断》",
            "未追赤松子，且泛黄菊英\n\t——李泌《奉和圣制重阳赐会聊示所怀》",
            "闻道故林相识多，罢官昨日今如何\n\t——李颀《送陈章甫》",
            "我欲穿花寻路，直入白云深处，浩气展虹霓\n\t——黄庭坚《水调歌头·游览》",
            "无情明月，有情归梦，同到幽闺\n\t——刘基《眼儿媚·秋思》",
            "无情有恨何人觉？月晓风清欲堕时\n\t——陆龟蒙《白莲》",
            "无情有恨何人觉？月晓风清欲堕时\n\t——陆龟蒙《白莲》",
            "无人知此意，歌罢满帘风\n\t——陈与义《临江仙·高咏楚词酬午日》",
            "无限伤心夕照中，故国凄凉，剩粉余红\n\t——夏完淳《一剪梅·咏柳》",
            "吾生如寄，尚想三径菊花丛\n\t——杨炎正《水调歌头·把酒对斜日》 ",
            "西风稍急喧窗竹，停又续，腻脸悬双玉\n\t——阎选《河传·秋雨》",
            "隰桑有阿，其叶有幽\n\t——佚名《隰桑》",
            "相思难表，梦魂无据，惟有归来是\n\t——欧阳修《青玉案·一年春事都来几》",
            "想翠竹、碧梧风采，旧游何处\n\t——张宁《满江红·题碧梧翠竹送李阳春》 ",
            "小姑织白纻，未解将人语\n\t——李白《湖边采莲妇》",
            "雁引愁心去，山衔好月来\n\t——李白《与夏十二登岳阳楼》",
            "雁足无书古塞幽。一程烟草一程愁\n\t——史达祖《鹧鸪天·卫县道中有怀其人》",
            "一朵江梅春带雪。玉软云娇，姑射肌肤洁\n\t——赵鼎《蝶恋花·一朵江梅春带雪》",
            "一年最好，偏是重阳\n\t——吴文英《惜黄花慢·菊》",
            "一去无消息，那能惜马蹄\n\t——薛道衡《昔昔盐》",
            "一任紫玉无情，夜寒吹裂\n\t——纳兰性德《琵琶仙·中秋》",
            "一声已动物皆静，四座无言星欲稀\n\t——李颀《琴歌》",
            "一水护田将绿绕，两山排闼送青来\n\t——王安石《书湖阴先生壁》",
            "依旧，依旧，人与绿杨俱瘦\n\t——秦观《如梦令·春景》 "
            "欹枕数秋天，蟾蜍下早弦\n\t——纳兰性德《菩萨蛮·萧萧几叶风兼雨》",
            "拥红妆，翻翠盖，花影暗南浦\n\t——高观国《祝英台近·荷花》",
            "有谁知我此时情，枕前泪共阶前雨，隔个窗儿滴到明\n\t——聂胜琼《鹧鸪天·别情》 ",
            "雨窗和泪摇湘管。意长笺短\n\t——许棐《后庭花·一春不识西湖面》",
            "雨过横塘水满堤，乱山高下路东西\n\t——曾巩《城南·雨过横塘水满堤》",
            "玉阶空伫立，宿鸟归飞急\n\t——李白《菩萨蛮·平林漠漠烟如织》",
            "玉楼深锁薄情种。清夜悠悠谁共\n\t——秦观《桃源忆故人·玉楼深锁薄情种》",
            "欲买桂花同载酒，终不是、少年游\n\t——刘过《唐多令·芦叶满汀洲》",
            "沅水通波接武冈，送君不觉有离伤\n\t——王昌龄《送柴侍御》",
            "远树带行客，孤城当落晖\n\t——王维《送綦毋潜落第还乡 / 送别》",
            "愿为西南风，长逝入君怀\n\t——曹植《明月上高楼》",
            "月色灯山满帝都，香车宝盖隘通衢\n\t——李商隐《观灯乐行》","锦瑟无端五十弦，一弦一柱思华年\n\t——李商隐《锦瑟》",
            "载酒春情，吹箫夜约，犹忆玉娇香软\n\t——高观国《齐天乐·碧云阙处无多雨》",
            "征蓬出汉塞，归雁入胡天\n\t——王维《使至塞上》",
            "灼灼野花香，依依金柳黄\n\t——佚名《菩萨蛮·霏霏点点回塘雨》",
            "醉月频中圣，迷花不事君\n\t——李白《赠孟浩然》",
            "昨日入城市，归来泪满巾\n\t——张俞《蚕妇》 ","借钱塘潮汐，为君洗尽，岳将军泪\n\t——陈德武《水龙吟·西湖怀古》",
            "坐上别愁君未见，归来欲断无肠\n\t——苏轼《临江仙·送王缄》",
    };
    int p = rand() % (sizeof(a) / sizeof(char[1005]));
    printf("%s\n", a[p]);
    fflush(stdout);
}
#endif //ELDER_COMM_SAY_H
